//=============================================================================
// インクルードファイル
//=============================================================================
#include "mode.h"
#include "renderer.h"
#include "application.h"
#include "player.h"
#include "Meshline.h"
#include "movelife.h"

CPlayer *CMode::m_pPlayer = nullptr;
CMeshLine *CMode::m_pMeshLine = nullptr;
CMovelife *CMode::m_MoveLife = nullptr;

CItem *CMode::m_Item = nullptr;
//=============================================================================
// コンストラクタ
//=============================================================================
CMode::CMode()
{
	//オブジェクトのタイプセット処理
	CObject::SetType(OBJTYPE_MODE);
}

//=============================================================================
// デストラクタ
//=============================================================================
CMode::~CMode()
{

}